package exception_and_strings;
//        /
//        * Сложная (6 баллов)
//        *
//        * Строка содержит названия товаров и цены на них в формате вида
//        * "Хлеб 39.9; Молоко 62; Курица 184.0; Конфеты 89.9".
//        * То есть, название товара отделено от цены пробелом,
//        * а цена отделена от названия следующего товара точкой с запятой и пробелом.
//        * Вернуть название самого дорогого товара в списке (в примере это Курица),
//        * или пустую строку при нарушении формата строки.
//        * Все цены должны быть больше нуля либо равны нулю.
//        * В случае неверной строки выкинуть свое исключение.
//        */

public class Goods {
    String[] goods;

}
